GaryThomas/CYD_projects/src/Esp32_CYD_TFT_eSPI_OpenWeather_landscape.cpp
#include <Arduino.h>
//
// Adapted for my CYD built with platformio by GDT, see:
// https://medium.com/@androidcrypto/create-an-internet-weather-station-with-3-days-forecast-on-an-esp32-cheap-yellow-display-cyd-15eb5c353b1d
// https://github.com/vasi2024/ESP32_CYD_Weather_Station_With_Forecast-main.git
//

/*
  The sketch is displaying a nice Internet Weather Station with 3 4 days forecast on an
  ESP32-Cheap Yellow Display (CYD) with 2.8-inch TFT display and 320x240 pixels resolution.

  The weather data is retrieved from OpenWeatherMap.org service and you need to get your own
  (free) API key before running the sketch.

  Please add the key, your Wi-Fi credentials, the location coordinates for the weather information and
  additional data about your Timezone in the settings file: 'All_Settings.h'.

  The code is not written by me, but from Daniel Eichhorn (https://blog.squix.ch) and was
  adapted by Bodmer as an example for his OpenWeather library (https://github.com/Bodmer/OpenWeather/).

  I modified this sketch for landscape display, added WiFi strength function and a 4-pixel circle to show data was
  refreshed.


  I changed lines of code to correct some issues, for more information see:
  https://github.com/Bodmer/OpenWeather/issues/26 1): Search for: String date = "Updated: " + strDate(local_time);
  Change to:  String date = "Updated: " + strDate(now());
  2)
  Search for: if ( today && id/100 == 8 && (forecast->dt[0] < forecast->sunrise || forecast->dt[0] > forecast->sunset))
  id += 1000; Change to:  if ( today && id/100 == 8 && (now() < forecast->sunrise || now() > forecast->sunset)) id +=
  1000;

  The code is optimized to run on the Cheap Yellow Display ('CYD') with a screen resolution of 320 x 240 pixels in
  Landscape orientation, that is the 'ESP32-2432S028R' variant.

  The weather icons and fonts are stored in ESP32's LittleFS filesystem, so you need to upload the files in the 'data'
  subfolder first before uploading the code and starting the device. See 'Upload_To_LittleFS.md' for more details about
  this.

              >>>       IMPORTANT TO PREVENT CRASHES      <<<
  >>>>>>  Set LittleFS to at least 1.5Mbytes before uploading files  <<<<<<

  The sketch is using the TFT_eSPI library by Bodmer (https://github.com/Bodmer/TFT_eSPI), so please select the correct
  'User_Setups' file in the library folder. I prepare two files (see my GitHub Repository) that should work:
  For older device with one USB connector (chip driver ILI9341) use:
    Setup801_ESP32_CYD_ILI9341_240x320.h
  New devices with two USB connectors (chip driver ST7789) require:
    Setup805_ESP32_CYD_ST7789_240x320.h

  Original by Daniel Eichhorn, see license at end of file.

*/

/*
  This sketch uses font files created from the Noto family of fonts as bitmaps
  generated from these fonts may be freely distributed:
  https://www.google.com/get/noto/

  A processing sketch to create new fonts can be found in the Tools folder of TFT_eSPI
  https://github.com/Bodmer/TFT_eSPI/tree/master/Tools/Create_Smooth_Font/Create_font
  New fonts can be generated to include language specific characters. The Noto family
  of fonts has an extensive character set coverage.

  Json streaming parser (do not use IDE library manager version) to use is here:
  https://github.com/Bodmer/JSON_Decoder
*/

#define SERIAL_MESSAGES      // For serial output weather reports
#define UI_BACKGROUND 0xD69A // TFT_LIGHTGREY
#define UI_NAVY 0x000F       // Deep Blue for headers/WiFi
#define UI_CHARCOAL 0x4228   // Professional Grey for separators
#define UI_TEMP_BLUE 0x001F  // Pure Blue for temperature
#define TFT_BL                                                                                                         \
    21 // Backlight pin for most CYD models
       // #define SCREEN_SERVER   // For dumping screen shots from TFT
       // #define RANDOM_LOCATION // Test only, selects random weather location every refresh
       // #define FORMAT_LittleFS   // Wipe LittleFS and all files!

const char *PROGRAM_VERSION = "ESP32 CYD OpenWeatherMap LittleFS V02.1";

#include <FS.h>
#include <LittleFS.h>
#include <SD.h>
#include <SPI.h>

#define AA_FONT_SMALL "fonts/NSBold15" // 15 point Noto sans serif bold
#define AA_FONT_LARGE "fonts/NSBold36" // 36 point Noto sans serif bold
/***************************************************************************************
**                          Load the libraries and settings
***************************************************************************************/
#include <Arduino.h>
// #include <ESP32_240x320.h>
#include <SPI.h>
#include <TFT_eSPI.h> // https://github.com/Bodmer/TFT_eSPI

// Additional functions
#include "GfxUi.h" // Attached to this sketch

// Choose library to load
#ifdef ESP8266
#include <ESP8266WiFi.h>
#elif defined(ARDUINO_ARCH_MBED) || defined(ARDUINO_ARCH_RP2040)
#if defined(ARDUINO_RASPBERRY_PI_PICO_W)
#include <WiFi.h>
#else
#include <WiFiNINA.h>
#endif
#else // ESP32
#include <WiFi.h>
#endif

// check All_Settings.h for adapting to your needs
#include "All_Settings.h"

#include <JSON_Decoder.h> // https://github.com/Bodmer/JSON_Decoder

#include <OpenWeather.h> // Latest here: https://github.com/Bodmer/OpenWeather

#include "NTP_Time.h" // Attached to this sketch, see that tab for library needs
// Time zone correction library: https://github.com/JChristensen/Timezone
Timezone *tz = &TIMEZONE;

/***************************************************************************************
**                          Define the globals and class instances
***************************************************************************************/

TFT_eSPI tft = TFT_eSPI(); // Invoke custom library

OW_Weather ow; // Weather forecast library instance

OW_forecast *forecast;

boolean booted = true;

GfxUi ui = GfxUi(&tft); // Jpeg and bmpDraw functions

long lastDownloadUpdate = millis();

/***************************************************************************************
**                          Declare prototypes
***************************************************************************************/
void updateData();
void drawProgress(uint8_t percentage, String text);
void drawTime();
void drawCurrentWeather();
void drawForecast();
void drawForecastDetail(uint16_t x, uint16_t y, uint8_t dayIndex);
const char *getMeteoconIcon(uint16_t id, bool today);
void drawAstronomy();
void drawSeparator(uint16_t y);
void fillSegment(int x, int y, int start_angle, int sub_angle, int r, unsigned int colour);
String strDate(time_t unixTime);
String strTime(time_t unixTime);
void printWeather(void);
void drawWifiQuality(int x, int y);
int leftOffset(String text, String sub);
int rightOffset(String text, String sub);
int splitIndex(String text);
int getNextDayIndex(void);

