GaryThomas/CYD_projects/src/Esp32_CYD_TFT_eSPI_OpenWeather_landscape.cpp
// ----------------------------
// SD Reader pins (default VSPI pins)
// ----------------------------
// #define SD_SCK 18
// #define SD_MISO 19
// #define SD_MOSI 23
// #define SD_CS 5

// ----------------------------

void listDir(fs::FS &fs, const char *dirname, uint8_t levels) {
    Serial.printf("Listing directory: %s\n", dirname);

    File root = fs.open(dirname);
    if (!root) {
        Serial.println("Failed to open directory");
        return;
    }
    if (!root.isDirectory()) {
        Serial.println("Not a directory");
        return;
    }

    File file = root.openNextFile();
    while (file) {
        if (file.isDirectory()) {
            Serial.print("  DIR : ");
            Serial.println(file.name());
            if (levels) {
                listDir(fs, file.path(), levels - 1);
            }
        } else {
            Serial.print("  FILE: ");
            Serial.print(file.name());
            Serial.print("  SIZE: ");
            Serial.println(file.size());
        }
        file = root.openNextFile();
    }
}

void createDir(fs::FS &fs, const char *path) {
    Serial.printf("Creating Dir: %s\n", path);
    if (fs.mkdir(path)) {
        Serial.println("Dir created");
    } else {
        Serial.println("mkdir failed");
    }
}

void removeDir(fs::FS &fs, const char *path) {
    Serial.printf("Removing Dir: %s\n", path);
    if (fs.rmdir(path)) {
        Serial.println("Dir removed");
    } else {
        Serial.println("rmdir failed");
    }
}

void readFile(fs::FS &fs, const char *path) {
    Serial.printf("Reading file: %s\n", path);

    File file = fs.open(path);
    if (!file) {
        Serial.println("Failed to open file for reading");
        return;
    }

    Serial.print("Read from file: ");
    while (file.available()) {
        Serial.write(file.read());
    }
    file.close();
}

void writeFile(fs::FS &fs, const char *path, const char *message) {
    Serial.printf("Writing file: %s\n", path);

    File file = fs.open(path, FILE_WRITE);
    if (!file) {
        Serial.println("Failed to open file for writing");
        return;
    }
    if (file.print(message)) {
        Serial.println("File written");
    } else {
        Serial.println("Write failed");
    }
    file.close();
}

void appendFile(fs::FS &fs, const char *path, const char *message) {
    Serial.printf("Appending to file: %s\n", path);

    File file = fs.open(path, FILE_APPEND);
    if (!file) {
        Serial.println("Failed to open file for appending");
        return;
    }
    if (file.print(message)) {
        Serial.println("Message appended");
    } else {
        Serial.println("Append failed");
    }
    file.close();
}

void renameFile(fs::FS &fs, const char *path1, const char *path2) {
    Serial.printf("Renaming file %s to %s\n", path1, path2);
    if (fs.rename(path1, path2)) {
        Serial.println("File renamed");
    } else {
        Serial.println("Rename failed");
    }
}

void deleteFile(fs::FS &fs, const char *path) {
    Serial.printf("Deleting file: %s\n", path);
    if (fs.remove(path)) {
        Serial.println("File deleted");
    } else {
        Serial.println("Delete failed");
    }
}

void testFileIO(fs::FS &fs, const char *path) {
    File file = fs.open(path);
    static uint8_t buf[512];
    size_t len = 0;
    uint32_t start = millis();
    uint32_t end = start;
    if (file) {
        len = file.size();
        size_t flen = len;
        start = millis();
        while (len) {
            size_t toRead = len;
            if (toRead > 512) {
                toRead = 512;
            }
            file.read(buf, toRead);
            len -= toRead;
        }
        end = millis() - start;
        Serial.printf("%u bytes read for %u ms\n", flen, end);
        file.close();
    } else {
        Serial.println("Failed to open file for reading");
    }

    file = fs.open(path, FILE_WRITE);
    if (!file) {
        Serial.println("Failed to open file for writing");
        return;
    }

    size_t i;
    start = millis();
    for (i = 0; i < 2048; i++) {
        file.write(buf, 512);
    }
    end = millis() - start;
    Serial.printf("%u bytes written for %u ms\n", 2048 * 512, end);
    file.close();
}

bool tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap) {
    // Stop further decoding as image is running off bottom of screen
    if (y >= tft.height())
        return 0;

    // This function will clip the image block rendering automatically at the TFT boundaries
    tft.pushImage(x, y, w, h, bitmap);

    // Return 1 to decode next block
    return 1;
}

void processSDCard() {
    if (SD.begin(SS, SPI, 80000000)) {
        uint8_t cardType = SD.cardType();

        if (cardType == CARD_NONE) {
            Serial.println("No SD card attached");
        } else {
            Serial.print("SD Card Type: ");
            if (cardType == CARD_MMC) {
                Serial.println("MMC");
            } else if (cardType == CARD_SD) {
                Serial.println("SDSC");
            } else if (cardType == CARD_SDHC) {
                Serial.println("SDHC");
            } else {
                Serial.println("UNKNOWN");
            }

            uint64_t cardSize = SD.cardSize() / (1024 * 1024);
            Serial.printf("SD Card Size: %lluMB\n", cardSize);

            listDir(SD, "/", 2);

            // Update settings, if available, from SD card
            if (SD.exists("/Settings.txt")) {
                Serial.println("... loading settings from SD card...");
                File settingsFile = SD.open("/Settings.txt");
                if (settingsFile) {
                    while (settingsFile.available()) {
                        String line = settingsFile.readStringUntil('\n');
                        line.trim();
                        if (line.startsWith("WIFI_SSID=")) {
                            wifiSSID = line.substring(strlen("WIFI_SSID="));
                            if (wifiSSID.startsWith("\"") && wifiSSID.endsWith("\"")) {
                                wifiSSID = wifiSSID.substring(1, wifiSSID.length() - 1);
                            }
                            Serial.printf("Loaded WiFi SSID: %s\n", wifiSSID.c_str());
                        } else if (line.startsWith("WIFI_PASSWORD=")) {
                            wifiPassword = line.substring(strlen("WIFI_PASSWORD="));
                            if (wifiPassword.startsWith("\"") && wifiPassword.endsWith("\"")) {
                                wifiPassword = wifiPassword.substring(1, wifiPassword.length() - 1);
                            }
                            Serial.printf("Loaded WiFi Password: %s\n", wifiPassword.c_str());
                        } else if (line.startsWith("longitude=")) {
                            longitude = line.substring(strlen("longitude="));
                            if (longitude.startsWith("\"") && longitude.endsWith("\"")) {
                                longitude = longitude.substring(1, longitude.length() - 1);
                            }
                            Serial.printf("Loaded Longitude: %s\n", longitude.c_str());
                        } else if (line.startsWith("latitude=")) {
                            latitude = line.substring(strlen("latitude="));
                            if (latitude.startsWith("\"") && latitude.endsWith("\"")) {
                                latitude = latitude.substring(1, latitude.length() - 1);
                            }
                            Serial.printf("Loaded Latitude: %s\n", latitude.c_str());
                        } else if (line.startsWith("units=")) {
                            units = line.substring(strlen("units="));
                            if (units.startsWith("\"") && units.endsWith("\"")) {
                                units = units.substring(1, units.length() - 1);
                            }
                            Serial.printf("Loaded Units: %s\n", units.c_str());
                        } else if (line.startsWith("timezone=")) {
                            String myTZ = line.substring(strlen("timezone="));
                            if (myTZ.startsWith("\"") && myTZ.endsWith("\"")) {
                                myTZ = myTZ.substring(1, myTZ.length() - 1);
                            }
                            // Set timezone handler, based on known ones from NTP_Time.h
                            struct knownZones {
                                const char *name;
                                Timezone *tz;
                            } knownTimezones[] = {
                                {"UK", &UK},     {"ausET", &ausET}, {"euCET", &euCET}, {"usMT", &usMT},
                                {"usPT", &usPT}, {"usCT", &usCT},   {"usET", &usET},
                            };
                            bool foundTZ = false;
                            for (auto &zone : knownTimezones) {
                                if (myTZ.equalsIgnoreCase(zone.name)) {
                                    tz = zone.tz;
                                    Serial.printf("Loaded Timezone: %s\n", myTZ.c_str());
                                    foundTZ = true;
                                    break;
                                }
                            }
                            if (!foundTZ) {
                                Serial.printf("Timezone %s not found, using default\n", myTZ.c_str());
                            }
                        }
                    }
                    settingsFile.close();
                } else {
                    Serial.println("Failed to open /Settings.txt for reading");
                }
            } else {
                Serial.println("No /Settings.txt found on SD card, using default settings");
            }
        }
    } else {
        Serial.println("Card Mount Failed");
    }
}

/***************************************************************************************
**                          Setup
***************************************************************************************/
void setup() {
    bool SDCardPresent = false;
    SPIClass spi = SPIClass(VSPI);

