GaryThomas/CYD_projects/src/Esp32_CYD_TFT_eSPI_OpenWeather_landscape.cpp
    Serial.begin(115200);
    delay(500);
    Serial.println(PROGRAM_VERSION);

    // Process SD card for settings, etc.
    processSDCard();

    // Set up PWM for the backlight
    // NEW Version for ESP32 Core 3.x
    pinMode(TFT_BL, OUTPUT);
    analogWrite(TFT_BL, 50); // Set to 50% brightness (0-255)

    tft.begin();
    tft.setRotation(3); // For 320x480 screen
    tft.fillScreen(TFT_BLACK);

    if (!LittleFS.begin()) {
        Serial.println("Flash FS initialisation failed!");
        while (1)
            yield(); // Stay here twiddling thumbs waiting
    }
    Serial.println("\nFlash FS available!");

// Enable if you want to erase LittleFS, this takes some time!
// then disable and reload sketch to avoid reformatting on every boot!
#ifdef FORMAT_LittleFS
    tft.setTextDatum(BC_DATUM); // Bottom Centre datum
    tft.drawString("Formatting LittleFS, so wait!", 120, 195);
    LittleFS.format();
#endif

    TJpgDec.setJpgScale(1);
    TJpgDec.setCallback(tft_output);
    TJpgDec.setSwapBytes(true); // May need to swap the jpg colour bytes (endianess)

    // Draw splash screen
    if (LittleFS.exists("/splash/OpenWeather.jpg") == true) {
        TJpgDec.drawFsJpg(40, 5, "/splash/OpenWeather.jpg", LittleFS);
        delay(3000);
    }

    // Clear bottom section of screen
    tft.fillRect(0, 140, 320, 240 - 140, TFT_BLACK);

    tft.loadFont(AA_FONT_SMALL, LittleFS);
    tft.setTextDatum(BC_DATUM); // Bottom Centre datum
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);

    tft.drawString("Original by: blog.squix.org", 160, 160);
    tft.drawString("Adapted by: Bodmer", 160, 180);
    tft.drawString("Modified by: BV", 160, 200);
    tft.drawString("Modified by: GDT", 160, 220);

    tft.setTextColor(TFT_YELLOW, TFT_BLACK);

    delay(3000);

    tft.fillRect(0, 140, 320, 240 - 140, TFT_BLACK);

    tft.drawString("Connecting to WiFi", 160, 150);
    tft.setTextPadding(150); // Pad next drawString() text to full width to over-write old text

// Call once for ESP32 and ESP8266
#if !defined(ARDUINO_ARCH_MBED)
    Serial.println("Connecting to WiFi..." + wifiSSID + " with password " + wifiPassword);
    WiFi.begin(wifiSSID, wifiPassword);
#endif

    while (WiFi.status() != WL_CONNECTED) {
        Serial.print(".");
#if defined(ARDUINO_ARCH_MBED) || defined(ARDUINO_ARCH_RP2040)
        if (WiFi.status() != WL_CONNECTED)
            WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
#endif
        delay(500);
    }
    Serial.println();

    tft.setTextDatum(BC_DATUM);
    tft.setTextPadding(240);       // Pad next drawString() text to full width to over-write old text
    tft.drawString(" ", 120, 220); // Clear line above using set padding width
    tft.drawString("Fetching weather data...", 160, 170);

    // Fetch the time
    udp.begin(localPort);
    syncTime();

    tft.unloadFont();
}

/***************************************************************************************
**                          Loop
***************************************************************************************/
void loop() {

    // Check if we should update weather information
    if (booted || (millis() - lastDownloadUpdate > 1000UL * UPDATE_INTERVAL_SECS)) {
        updateData();
        lastDownloadUpdate = millis();
    }

    // If minute has changed then request new time from NTP server
    if (booted || minute() != lastMinute) {
        // Update displayed time first as we may have to wait for a response
        drawTime();
        lastMinute = minute();

        // Request and synchronise the local clock
        syncTime();

#ifdef SCREEN_SERVER
        screenServer();
#endif
    }

    booted = false;
}

/***************************************************************************************
**                          Fetch the weather data  and update screen
***************************************************************************************/
// Update the Internet based information and update screen
void updateData() {
    // booted = true;  // Test only
    // booted = false; // Test only

    // Change TFT_RED to UI_GREY or TFT_BLUE for a calmer look
    if (booted)
        drawProgress(20, "Updating time...");
    else
        fillSegment(30, 30, 0, (int)(20 * 3.6), 18, TFT_BLUE);

    if (booted)
        drawProgress(50, "Updating conditions...");
    else
        fillSegment(30, 30, 0, (int)(50 * 3.6), 18, TFT_RED);

    // Create the structure that holds the retrieved weather
    forecast = new OW_forecast;

#ifdef RANDOM_LOCATION // Randomly choose a place on Earth to test icons etc
    String latitude = "";
    latitude = (random(180) - 90);
    String longitude = "";
    longitude = (random(360) - 180);
    Serial.print("Lat = ");
    Serial.print(latitude);
    Serial.print(", Lon = ");
    Serial.println(longitude);
#endif

    bool parsed = ow.getForecast(forecast, api_key, latitude, longitude, units, language);

    if (parsed)
        Serial.println("Data points received");
    else
        Serial.println("Failed to get data points");

    // Serial.print("Free heap = "); Serial.println(ESP.getFreeHeap(), DEC);

    printWeather(); // For debug, turn on output with #define SERIAL_MESSAGES

    if (booted) {
        drawProgress(100, "Done...");
        delay(3000);
        tft.fillScreen(TFT_LIGHTGREY);
    } else {
        fillSegment(30, 30, 0, 360, 18, TFT_RED);
        fillSegment(30, 30, 0, 360, 24, TFT_LIGHTGREY);
    }

    if (parsed) {
        tft.loadFont(AA_FONT_SMALL, LittleFS);
        drawCurrentWeather();
        drawForecast();
        drawAstronomy();
        tft.unloadFont();

        // Update the temperature here so we don't need to keep
        // loading and unloading font which takes time
        tft.loadFont(AA_FONT_LARGE, LittleFS);
        tft.setTextDatum(TR_DATUM);
        tft.setTextColor(TFT_BLUE, TFT_LIGHTGREY);

        // Font ASCII code 0xB0 is a degree symbol, but o used instead in small font
        tft.setTextPadding(tft.textWidth(" -88")); // Max width of values

        String weatherText = "";
        weatherText = String(forecast->temp[0], 0); // Make it integer temperature
        tft.drawString(weatherText, 215, 95);       //  + "°" symbol is big... use o in small font
        tft.unloadFont();
    } else {
        Serial.println("Failed to get weather");
    }
    // Draw a small 4-pixel circle to show data was refreshed
    if (parsed) {
        tft.fillCircle(310, 230, 3, 0x03E0); // Bright Green dot in bottom right
    } else {
        tft.fillCircle(310, 230, 3, 0xF800); // Red dot if it failed
    }
    // Delete to free up space
    delete forecast;
}

/***************************************************************************************
**                          Update progress bar
***************************************************************************************/
void drawProgress(uint8_t percentage, String text) {
    tft.loadFont(AA_FONT_SMALL, LittleFS);
    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setTextPadding(320);
    tft.drawString(text, 160, 220);

