GaryThomas/CYD_projects/src/Esp32_CYD_TFT_eSPI_OpenWeather_landscape.cpp
    ui.drawProgressBar(20, 180, 320 - 40, 15, percentage, TFT_WHITE, TFT_BLUE);

    tft.setTextPadding(0);
    tft.unloadFont();
}

/***************************************************************************************
**  WiFi Strength Function
***************************************************************************************/

void drawWifiQuality(int x, int y) {
    int32_t dbm = WiFi.RSSI();
    int8_t quality;

    // Convert dBm to 0-4 bars
    if (dbm <= -100)
        quality = 0;
    else if (dbm >= -50)
        quality = 4;
    else
        quality = 2 * (dbm + 100) / 25;

    for (int8_t i = 0; i < 4; i++) {
        // If bar is within quality range, color it Navy, otherwise Light Grey
        uint16_t barColor = (i < quality) ? 0x000F : 0xD69A;
        // Draw bars with increasing height
        tft.fillRect(x + (i * 5), y + (10 - (i * 3)), 3, (i * 3) + 2, barColor);
    }
}

/***************************************************************************************
**                          Draw the clock digits
***************************************************************************************/
void drawTime() {
    tft.loadFont(AA_FONT_LARGE, LittleFS);

    // Draw the WiFi bars in the top right (X=290, Y=5)
    drawWifiQuality(300, 1);

    // Convert UTC to local time, returns zone code in tz1_Code, e.g "GMT"
    time_t local_time = tz->toLocal(now(), &tz1_Code);

    String timeNow = "";

    if (hour(local_time) < 10)
        timeNow += "0";
    timeNow += hour(local_time);
    timeNow += ":";
    if (minute(local_time) < 10)
        timeNow += "0";
    timeNow += minute(local_time);

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLUE, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth(" 44:44 ")); // String width + margin
    tft.drawString(timeNow, 120, 53);

    drawSeparator(51);

    tft.setTextPadding(0);

    tft.unloadFont();
}

/***************************************************************************************
**                          Draw the current weather
***************************************************************************************/
void drawCurrentWeather() {
    time_t local_time = tz->toLocal(now(), &tz1_Code);
    // String date = "Updated: " + strDate(local_time);
    String date = "Updated: " + strDate(now()); // see isue https://github.com/Bodmer/OpenWeather/issues/26
    String weatherText = "None";

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(0x000F, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth(" Updated: Mmm 44 44:44 ")); // String width + margin
    tft.drawString(date, 120, 16);

    String weatherIcon = "";

    String currentSummary = forecast->main[0];
    currentSummary.toLowerCase();

    weatherIcon = getMeteoconIcon(forecast->id[0], true);

    ui.drawBmp("/icon/" + weatherIcon + ".bmp", 0, 53);

    // Weather Text
    if (language == "en")
        weatherText = forecast->main[0];
    else
        weatherText = forecast->description[0];

    tft.setTextDatum(BR_DATUM);
    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);

    int splitPoint = 0;
    int xpos = 235;
    splitPoint = splitIndex(weatherText);

    tft.setTextPadding(xpos - 100); // xpos - icon width
    if (splitPoint)
        tft.drawString(weatherText.substring(0, splitPoint), xpos, 69);
    else
        tft.drawString(" ", xpos, 69);
    tft.drawString(weatherText.substring(splitPoint), xpos, 86);

    tft.setTextColor(TFT_BLUE, TFT_LIGHTGREY);
    tft.setTextDatum(TR_DATUM);
    tft.setTextPadding(0);
    if (units == "metric")
        tft.drawString("oC", 237, 95);
    else
        tft.drawString("oF", 237, 95);

    // Temperature large digits added in updateData() to save swapping font here

    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);
    weatherText = String(forecast->wind_speed[0], 0);

    if (units == "metric")
        weatherText += " m/s";
    else
        weatherText += " mph";

    tft.setTextDatum(TC_DATUM);
    tft.setTextPadding(tft.textWidth("888 m/s")); // Max string length?
    tft.drawString(weatherText, 124, 136);

    if (units == "imperial") {
        weatherText = forecast->pressure[0];
        weatherText += " in";
    } else {
        weatherText = String(forecast->pressure[0], 0);
        weatherText += " hPa";
    }

    tft.setTextDatum(TR_DATUM);
    tft.setTextPadding(tft.textWidth(" 8888hPa")); // Max string length?
    tft.drawString(weatherText, 230, 136);

    int windAngle = (forecast->wind_deg[0] + 22.5) / 45;
    if (windAngle > 7)
        windAngle = 0;
    String wind[] = {"N", "NE", "E", "SE", "S", "SW", "W", "NW"};
    ui.drawBmp("/wind/" + wind[windAngle] + ".bmp", 101, 86);

    drawSeparator(152);

    tft.setTextDatum(TL_DATUM); // Reset datum to normal
    tft.setTextPadding(0);      // Reset padding width to none
}

/***************************************************************************************
**                          Draw the 4 forecast columns
***************************************************************************************/
// draws the three forecast columns
void drawForecast() {
    int8_t dayIndex = getNextDayIndex();

#if FORECAST_INCLUDES_TODAY
    drawForecastDetail(8, 171, 0);
#else
    drawForecastDetail(8, 171, dayIndex);
    dayIndex += 8;
#endif
    drawForecastDetail(66, 171, dayIndex); // was 95
    dayIndex += 8;
    drawForecastDetail(124, 171, dayIndex); // was 180
    dayIndex += 8;
    drawForecastDetail(182, 171, dayIndex); // was 180
}

/***************************************************************************************
**                          Draw 1 forecast column at x, y
***************************************************************************************/
// helper for the forecast columns
void drawForecastDetail(uint16_t x, uint16_t y, uint8_t dayIndex) {

    if (dayIndex >= MAX_DAYS * 8)
        return;
    String day = shortDOW[weekday(tz->toLocal(forecast->dt[dayIndex + 4], &tz1_Code))];
    day.toUpperCase();

    tft.setTextDatum(BC_DATUM);

    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth("WWW"));
    tft.drawString(day, x + 25, y);

    tft.setTextColor(0x000F, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth("-88   -88"));

