GaryThomas/CYD_projects/src/Esp32_CYD_TFT_eSPI_OpenWeather_landscape.cpp
    // Find the temperature min and max during the day
    float tmax = -9999;
    float tmin = 9999;
    for (int i = 0; i < 8; i++)
        if (forecast->temp_max[dayIndex + i] > tmax)
            tmax = forecast->temp_max[dayIndex + i];
    for (int i = 0; i < 8; i++)
        if (forecast->temp_min[dayIndex + i] < tmin)
            tmin = forecast->temp_min[dayIndex + i];

    String highTemp = String(tmax, 0);
    String lowTemp = String(tmin, 0);
    tft.drawString(highTemp + " " + lowTemp, x + 25, y + 17);

    String weatherIcon = getMeteoconIcon(forecast->id[dayIndex + 4], false);

    ui.drawBmp("/icon50/" + weatherIcon + ".bmp", x, y + 18);

    tft.setTextPadding(0); // Reset padding width to none
}

/***************************************************************************************
**                          Draw Sun rise/set, Moon, cloud cover and humidity
***************************************************************************************/
uint8_t moon_phase(int year, int month, int day, double hour, int *ip);

void drawAstronomy() {

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth(" Last qtr "));

    time_t local_time = tz->toLocal(forecast->dt[0], &tz1_Code);
    uint16_t y = year(local_time);
    uint8_t m = month(local_time);
    uint8_t d = day(local_time);
    uint8_t h = hour(local_time);
    int ip;
    uint8_t icon = moon_phase(y, m, d, h, &ip);

    tft.drawString(moonPhase[ip], 275, 152);
    ui.drawBmp("/moon/moonphase_L" + String(icon) + ".bmp", 275 - 30, 150 - 16 - 60);

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);
    tft.setTextPadding(0); // Reset padding width to none
    tft.drawString(sunStr, 250, 16);

    tft.setTextDatum(BR_DATUM);
    tft.setTextColor(TFT_BLUE, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth(" 88:88 "));

    String rising = strTime(forecast->sunrise) + " ";
    int dt = rightOffset(rising, ":"); // Draw relative to colon to them aligned
    tft.drawString(rising, 250 + dt, 35);

    String setting = strTime(forecast->sunset) + " ";
    dt = rightOffset(setting, ":");
    tft.drawString(setting, 250 + dt, 50);

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);
    tft.drawString(cloudStr, 275, 170); // <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< ?

    String cloudCover = "";
    cloudCover += forecast->clouds_all[0];
    cloudCover += "%";

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLUE, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth(" 100%"));
    tft.drawString(cloudCover, 275, 190);

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLACK, TFT_LIGHTGREY);
    tft.drawString(humidityStr, 275, 215 - 2); // <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<< ?

    String humidity = "";
    humidity += forecast->humidity[0];
    humidity += "%";

    tft.setTextDatum(BC_DATUM);
    tft.setTextColor(TFT_BLUE, TFT_LIGHTGREY);
    tft.setTextPadding(tft.textWidth("100%"));
    tft.drawString(humidity, 275, 230);

    tft.setTextPadding(0); // Reset padding width to none
}

/***************************************************************************************
**                          Get the icon file name from the index number
***************************************************************************************/
const char *getMeteoconIcon(uint16_t id, bool today) {
    // if ( today && id/100 == 8 && (forecast->dt[0] < forecast->sunrise || forecast->dt[0] > forecast->sunset)) id +=
    // 1000;
    if (today && id / 100 == 8 && (now() < forecast->sunrise || now() > forecast->sunset))
        id += 1000;
    // see issue https://github.com/Bodmer/OpenWeather/issues/26
    if (id / 100 == 2)
        return "thunderstorm";
    if (id / 100 == 3)
        return "drizzle";
    if (id / 100 == 4)
        return "unknown";
    if (id == 500)
        return "lightRain";
    else if (id == 511)
        return "sleet";
    else if (id / 100 == 5)
        return "rain";
    if (id >= 611 && id <= 616)
        return "sleet";
    else if (id / 100 == 6)
        return "snow";
    if (id / 100 == 7)
        return "fog";
    if (id == 800)
        return "clear-day";
    if (id == 801)
        return "partly-cloudy-day";
    if (id == 802)
        return "cloudy";
    if (id == 803)
        return "cloudy";
    if (id == 804)
        return "cloudy";
    if (id == 1800)
        return "clear-night";
    if (id == 1801)
        return "partly-cloudy-night";
    if (id == 1802)
        return "cloudy";
    if (id == 1803)
        return "cloudy";
    if (id == 1804)
        return "cloudy";

    return "unknown";
}

/***************************************************************************************
**                          Draw screen section separator line
***************************************************************************************/
// if you don't want separators, comment out the tft-line
void drawSeparator(uint16_t y) {
    // Top line: Dark Charcoal
    tft.drawFastHLine(10, y, 300, UI_CHARCOAL);
    // Bottom line: White (creates a "highlight" or "etched" effect)
    tft.drawFastHLine(10, y + 1, 300, TFT_WHITE);
}

/***************************************************************************************
**                          Determine place to split a line line
***************************************************************************************/
// determine the "space" split point in a long string
int splitIndex(String text) {
    uint16_t index = 0;
    while ((text.indexOf(' ', index) >= 0) && (index <= text.length() / 2)) {
        index = text.indexOf(' ', index) + 1;
    }
    if (index)
        index--;
    return index;
}

/***************************************************************************************
**                          Right side offset to a character
***************************************************************************************/
// Calculate coord delta from end of text String to start of sub String contained within that text
// Can be used to vertically right align text so for example a colon ":" in the time value is always
// plotted at same point on the screen irrespective of different proportional character widths,
// could also be used to align decimal points for neat formatting
int rightOffset(String text, String sub) {
    int index = text.indexOf(sub);
    return tft.textWidth(text.substring(index));
}

/***************************************************************************************
**                          Left side offset to a character
***************************************************************************************/
// Calculate coord delta from start of text String to start of sub String contained within that text
// Can be used to vertically left align text so for example a colon ":" in the time value is always
// plotted at same point on the screen irrespective of different proportional character widths,
// could also be used to align decimal points for neat formatting
int leftOffset(String text, String sub) {
    int index = text.indexOf(sub);
    return tft.textWidth(text.substring(0, index));
}

/***************************************************************************************
**                          Draw circle segment
***************************************************************************************/
// Draw a segment of a circle, centred on x,y with defined start_angle and subtended sub_angle
// Angles are defined in a clockwise direction with 0 at top
// Segment has radius r and it is plotted in defined colour
// Can be used for pie charts etc, in this sketch it is used for wind direction
#define DEG2RAD 0.0174532925 // Degrees to Radians conversion factor
#define INC 2                // Minimum segment subtended angle and plotting angle increment (in degrees)
void fillSegment(int x, int y, int start_angle, int sub_angle, int r, unsigned int colour) {
    // Calculate first pair of coordinates for segment start
    float sx = cos((start_angle - 90) * DEG2RAD);
    float sy = sin((start_angle - 90) * DEG2RAD);
    uint16_t x1 = sx * r + x;
    uint16_t y1 = sy * r + y;

    // Draw colour blocks every INC degrees
    for (int i = start_angle; i < start_angle + sub_angle; i += INC) {

